salao/app/controllers/categoria_controller.rb

SELECT "categoria".* FROM "categoria"
---
  def index
    @categoria = Categoria.all

SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @categorium = Categoria.find(params[:id])

SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @categorium = Categoria.find(params[:id])

INSERT INTO "categoria" ("created_at", "descricao", "nome", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 29 Nov 2013 16:01:56 UTC +00:00], ["descricao", "abx"], ["nome", "Categoria 1"], ["updated_at", Fri, 29 Nov 2013 16:01:56 UTC +00:00]]
---
  def create
    @categorium = Categoria.new(params[:categorium])

    respond_to do |format|
      if @categorium.save

SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "categoria" WHERE "categoria"."id" = $1  [["id", 2]]
---
  def destroy
    @categorium = Categoria.find(params[:id])
    @categorium.destroy