salao/app/controllers/clientes_controller.rb

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("aniversario", "created_at", "obs", "pessoa_id", "sexo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def aniversariante
    @clientes=Cliente.where("aniversario like '%_-#{Date.today.month}-_%'")
---
SELECT "clientes".* FROM "clientes" WHERE (aniversario like '%_-12-_%')