salao/app/controllers/pessoas_controller.rb

SELECT "pessoas".* FROM "pessoas"
---
  def index
    @pessoas = Pessoa.all

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @pessoa = Pessoa.find(params[:id])

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @pessoa = Pessoa.find(params[:id])

INSERT INTO "pessoas" ("apelido", "celular", "created_at", "email", "endereco", "nome", "telefone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @pessoa = Pessoa.new(params[:pessoa])

    respond_to do |format|
      if @pessoa.save

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "pessoas" SET "nome" = 'Nathan Dias Anrade', "telefone" = '36225139', "email" = 'nathan_ita@hotmail.com', "updated_at" = '2013-11-29 15:57:08.487225' WHERE "pessoas"."id" = 1
---
  def update
    @pessoa = Pessoa.find(params[:id])

    respond_to do |format|
      if @pessoa.update_attributes(params[:pessoa])

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "pessoas" WHERE "pessoas"."id" = $1  [["id", 2]]
---
  def destroy
    @pessoa = Pessoa.find(params[:id])
    @pessoa.destroy