salao/app/controllers/realizas_controller.rb

SELECT "realizas".* FROM "realizas" WHERE "realizas"."satatus" = 't'
---
  def atendimento
    @reallizou=Realiza.where(:satatus=>true)