salao/app/controllers/realizas_controller.rb

  def index
    @realizas = Realiza.all
---
SELECT "realizas".* FROM "realizas"

  def new
    @realiza = Realiza.new
    @pessoas=Pessoa.select("clientes.id,pessoas.nome").joins(:cliente)
    @funcionarios=Pessoa.select("usuarios.id,pessoas.nome").joins(:usuario)
    #@pessoas=Pessoa.select("clientes.id,pessoas.nome").joins(:clientes)
    #@funcionarios=Pessoa.where("id in (?)",Usuario.select("pessoa_id as id").map(&:id))
    @servicos=Servico.all
---
SELECT usuarios.id,pessoas.nome FROM "pessoas" INNER JOIN "usuarios" ON "usuarios"."pessoa_id" = "pessoas"."id"
SELECT "servicos".* FROM "servicos"

  def agenda_hoje
    @realizas = Realiza.where(:data=>Date.today).where(:satatus=>nil)
---
SELECT "realizas".* FROM "realizas" WHERE "realizas"."data" = '2013-12-02' AND "realizas"."satatus" IS NULL AND (created_at != 'NULL')

  def atendimento
    @reallizou=Realiza.where(:status=>"1")
    @funcionarios=Pessoa.select("usuarios.id,pessoas.nome").joins(:usuario)
---
SELECT "realizas".* FROM "realizas" WHERE "realizas"."status" = '1'
SELECT usuarios.id,pessoas.nome FROM "pessoas" INNER JOIN "usuarios" ON "usuarios"."pessoa_id" = "pessoas"."id"