salao/app/controllers/servicos_controller.rb

SELECT "servicos".* FROM "servicos"
---
  def index
    @servicos = Servico.all

SELECT "servicos".* FROM "servicos" WHERE "servicos"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    @servico = Servico.find(params[:id])

SELECT "categories".* FROM "categories"
---
  def new
    @servico = Servico.new
    @categorias = Category.all

SELECT "servicos".* FROM "servicos" WHERE "servicos"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "categories".* FROM "categories"
---
  def edit
    @servico = Servico.find(params[:id])
    @categorias = Category.all

INSERT INTO "servicos" ("category_id", "created_at", "descricao", "nome", "preco", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 1], ["created_at", Tue, 03 Dec 2013 02:56:50 UTC +00:00], ["descricao", ""], ["nome", "Corte Masculino"], ["preco", 12.0], ["updated_at", Tue, 03 Dec 2013 02:56:50 UTC +00:00]]
---
  def create
    @servico = Servico.new(params[:servico])

    respond_to do |format|
      if @servico.save

SELECT "servicos".* FROM "servicos" WHERE "servicos"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def update
    @servico = Servico.find(params[:id])

SELECT sum(preco) as valor,servicos.*,realizas.* FROM "realizas" INNER JOIN "servicos" ON "servicos"."id" = "realizas"."servico_id" GROUP BY nome ORDER BY nome asc
---
  def relatorio
    @relatorio=Realiza.select("sum(preco) as valor,servicos.*,realizas.*").joins(:servico).group(:nome).order("nome asc")