salao/app/views/realizas/_form.html.erb

      <select name="pagamento">
      <% Formapagamentoe.all.each do |p| %>
---
SELECT "formapagamentoes".* FROM "formapagamentoes"