salao/app/views/servicos/_form.html.erb

    <label class="control-label" for="inputEmail">Categoria:</label>
    <%= f.collection_select(:category_id,Category.all,:id,:nome) %>
---
SELECT "categories".* FROM "categories"