salao/app/views/servicos/_form.html.erb

    <%= f.label :categoria_id %><br />
    <%= f.collection_select(:categoria_id,Categoria.all,:id,:nome) %>
---
SELECT "categoria".* FROM "categoria"